grevaillot/svd_tools/headers/STM32H7x5_CM4/adc3.h
#define ADC3_CFGR_EXTEN_SHIFT		10
#define ADC3_CFGR_EXTEN_MASK		0x03
/** @defgroup adc3_cfgr_exten EXTEN ADC group regular external trigger polarity
@{*/
/**@}*/


#define ADC3_CFGR_EXTSEL_SHIFT		5
#define ADC3_CFGR_EXTSEL_MASK		0x1f
/** @defgroup adc3_cfgr_extsel EXTSEL ADC group regular external trigger source
@{*/
/**@}*/


#define ADC3_CFGR_RES_SHIFT		2
#define ADC3_CFGR_RES_MASK		0x07
/** @defgroup adc3_cfgr_res RES ADC data resolution
@{*/
/**@}*/


#define ADC3_CFGR_DMNGT_SHIFT		0
#define ADC3_CFGR_DMNGT_MASK		0x03
/** @defgroup adc3_cfgr_dmngt DMNGT ADC DMA transfer enable
@{*/
/**@}*/


/**@}*/

/** @defgroup adc3_cfgr2 CFGR2 ADC configuration register 2
@{*/


#define ADC3_CFGR2_LSHIFT_SHIFT		28
#define ADC3_CFGR2_LSHIFT_MASK		0x0f
/** @defgroup adc3_cfgr2_lshift LSHIFT Left shift factor
@{*/
/**@}*/


#define ADC3_CFGR2_OSR_SHIFT		16
#define ADC3_CFGR2_OSR_MASK		0x3ff
/** @defgroup adc3_cfgr2_osr OSR Oversampling ratio
@{*/
/**@}*/

/** ADC3_CFGR2_RSHIFT4 Right-shift data after Offset 4 correction **/
#define ADC3_CFGR2_RSHIFT4		(1 << 14)
/** ADC3_CFGR2_RSHIFT3 Right-shift data after Offset 3 correction **/
#define ADC3_CFGR2_RSHIFT3		(1 << 13)
/** ADC3_CFGR2_RSHIFT2 Right-shift data after Offset 2 correction **/
#define ADC3_CFGR2_RSHIFT2		(1 << 12)
/** ADC3_CFGR2_RSHIFT1 Right-shift data after Offset 1 correction **/
#define ADC3_CFGR2_RSHIFT1		(1 << 11)
/** ADC3_CFGR2_ROVSM Regular Oversampling mode **/
#define ADC3_CFGR2_ROVSM		(1 << 10)
/** ADC3_CFGR2_TROVS ADC oversampling discontinuous mode (triggered mode) for ADC group regular **/
#define ADC3_CFGR2_TROVS		(1 << 9)

#define ADC3_CFGR2_OVSS_SHIFT		5
#define ADC3_CFGR2_OVSS_MASK		0x0f
/** @defgroup adc3_cfgr2_ovss OVSS ADC oversampling shift
@{*/
/**@}*/

/** ADC3_CFGR2_JOVSE ADC oversampler enable on scope ADC group injected **/
#define ADC3_CFGR2_JOVSE		(1 << 1)
/** ADC3_CFGR2_ROVSE ADC oversampler enable on scope ADC group regular **/
#define ADC3_CFGR2_ROVSE		(1 << 0)

/**@}*/

/** @defgroup adc3_smpr1 SMPR1 ADC sampling time register 1
@{*/


#define ADC3_SMPR1_SMP9_SHIFT		27
#define ADC3_SMPR1_SMP9_MASK		0x07
/** @defgroup adc3_smpr1_smp9 SMP9 ADC channel 9 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP8_SHIFT		24
#define ADC3_SMPR1_SMP8_MASK		0x07
/** @defgroup adc3_smpr1_smp8 SMP8 ADC channel 8 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP7_SHIFT		21
#define ADC3_SMPR1_SMP7_MASK		0x07
/** @defgroup adc3_smpr1_smp7 SMP7 ADC channel 7 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP6_SHIFT		18
#define ADC3_SMPR1_SMP6_MASK		0x07
/** @defgroup adc3_smpr1_smp6 SMP6 ADC channel 6 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP5_SHIFT		15
#define ADC3_SMPR1_SMP5_MASK		0x07
/** @defgroup adc3_smpr1_smp5 SMP5 ADC channel 5 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP4_SHIFT		12
#define ADC3_SMPR1_SMP4_MASK		0x07
/** @defgroup adc3_smpr1_smp4 SMP4 ADC channel 4 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP3_SHIFT		9
#define ADC3_SMPR1_SMP3_MASK		0x07
/** @defgroup adc3_smpr1_smp3 SMP3 ADC channel 3 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP2_SHIFT		6
#define ADC3_SMPR1_SMP2_MASK		0x07
/** @defgroup adc3_smpr1_smp2 SMP2 ADC channel 2 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR1_SMP1_SHIFT		3
#define ADC3_SMPR1_SMP1_MASK		0x07
/** @defgroup adc3_smpr1_smp1 SMP1 ADC channel 1 sampling time selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc3_smpr2 SMPR2 ADC sampling time register 2
@{*/


#define ADC3_SMPR2_SMP19_SHIFT		27
#define ADC3_SMPR2_SMP19_MASK		0x07
/** @defgroup adc3_smpr2_smp19 SMP19 ADC channel 18 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP18_SHIFT		24
#define ADC3_SMPR2_SMP18_MASK		0x07
/** @defgroup adc3_smpr2_smp18 SMP18 ADC channel 18 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP17_SHIFT		21
#define ADC3_SMPR2_SMP17_MASK		0x07
/** @defgroup adc3_smpr2_smp17 SMP17 ADC channel 17 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP16_SHIFT		18
#define ADC3_SMPR2_SMP16_MASK		0x07
/** @defgroup adc3_smpr2_smp16 SMP16 ADC channel 16 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP15_SHIFT		15
#define ADC3_SMPR2_SMP15_MASK		0x07
/** @defgroup adc3_smpr2_smp15 SMP15 ADC channel 15 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP14_SHIFT		12
#define ADC3_SMPR2_SMP14_MASK		0x07
/** @defgroup adc3_smpr2_smp14 SMP14 ADC channel 14 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP13_SHIFT		9
#define ADC3_SMPR2_SMP13_MASK		0x07
/** @defgroup adc3_smpr2_smp13 SMP13 ADC channel 13 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP12_SHIFT		6
#define ADC3_SMPR2_SMP12_MASK		0x07
/** @defgroup adc3_smpr2_smp12 SMP12 ADC channel 12 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP11_SHIFT		3
#define ADC3_SMPR2_SMP11_MASK		0x07
/** @defgroup adc3_smpr2_smp11 SMP11 ADC channel 11 sampling time selection
@{*/
/**@}*/


#define ADC3_SMPR2_SMP10_SHIFT		0
#define ADC3_SMPR2_SMP10_MASK		0x07
/** @defgroup adc3_smpr2_smp10 SMP10 ADC channel 10 sampling time selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc3_pcsel PCSEL ADC pre channel selection register
@{*/


#define ADC3_PCSEL_PCSEL_SHIFT		0
#define ADC3_PCSEL_PCSEL_MASK		0xfffff
/** @defgroup adc3_pcsel_pcsel PCSEL Channel x (VINP[i]) pre selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc3_ltr1 LTR1 ADC analog watchdog 1 threshold register
@{*/


#define ADC3_LTR1_LTR1_SHIFT		0
#define ADC3_LTR1_LTR1_MASK		0x3ffffff
/** @defgroup adc3_ltr1_ltr1 LTR1 ADC analog watchdog 1 threshold low
@{*/
/**@}*/


/**@}*/

/** @defgroup adc3_lhtr1 LHTR1 ADC analog watchdog 2 threshold register
@{*/


#define ADC3_LHTR1_LHTR1_SHIFT		0
#define ADC3_LHTR1_LHTR1_MASK		0x3ffffff
/** @defgroup adc3_lhtr1_lhtr1 LHTR1 ADC analog watchdog 2 threshold low
@{*/
/**@}*/


/**@}*/

/** @defgroup adc3_sqr1 SQR1 ADC group regular sequencer ranks register 1
@{*/


#define ADC3_SQR1_SQ4_SHIFT		24
#define ADC3_SQR1_SQ4_MASK		0x1f
/** @defgroup adc3_sqr1_sq4 SQ4 ADC group regular sequencer rank 4
@{*/
/**@}*/


#define ADC3_SQR1_SQ3_SHIFT		18
#define ADC3_SQR1_SQ3_MASK		0x1f
/** @defgroup adc3_sqr1_sq3 SQ3 ADC group regular sequencer rank 3
@{*/
/**@}*/


#define ADC3_SQR1_SQ2_SHIFT		12
#define ADC3_SQR1_SQ2_MASK		0x1f
/** @defgroup adc3_sqr1_sq2 SQ2 ADC group regular sequencer rank 2
@{*/
/**@}*/


#define ADC3_SQR1_SQ1_SHIFT		6
#define ADC3_SQR1_SQ1_MASK		0x1f
/** @defgroup adc3_sqr1_sq1 SQ1 ADC group regular sequencer rank 1
@{*/
/**@}*/


#define ADC3_SQR1_L3_SHIFT		0
#define ADC3_SQR1_L3_MASK		0x0f
/** @defgroup adc3_sqr1_l3 L3 L3
@{*/
/**@}*/


/**@}*/

